[{"model": "books.book", "pk": 1, "fields": {"author": "Peter Thiel,Blake Masters", "title": "Zero to One", "subtitle": "Notes on Start Ups, Or How to Build the Future", "description": "WHAT VALUABLE COMPANY IS NOBODY BUILDING? The next Bill Gates will not build an operating system. The next Larry Page or Sergey Brin won't make a search engine. If you are copying these guys, you aren't learning from them. It's easier to copy a model than to make something new: doing what we already know how to do takes the world from 1 to n, adding more of something familiar. Every new creation goes from 0 to 1. This book is about how to get there. 'Peter Thiel has built multiple breakthrough companies, and Zero to One shows how.' ELON MUSK, CEO of SpaceX and Tesla 'This book delivers completely new and refreshing ideas on how to create value in the world.' MARK ZUCKERBERG, CEO of Facebook 'When a risk taker writes a book, read it. In the case of Peter Thiel, read it twice. Or, to be safe, three times. This is a classic.' NASSIM NICHOLAS TALEB, author of The Black Swan", "image_url": "http://books.google.com.br/books/content?id=rMFtnQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "isbn": "9780753555194", "number_of_pages": 224, "publication_date": "2014-09-15", "publisher": "Virgin Books"}}, {"model": "books.book", "pk": 2, "fields": {"author": "Pramod J. Sadalage,Martin Fowler", "title": "NoSQL Distilled", "subtitle": "A Brief Guide to the Emerging World of Polyglot Persistence", "description": "The definitive introduction to NoSQL, the breakthrough performance and scalability solution for cloud-based database applications * *Co-authored by the legendary Martin Fowler: does for NoSQL what he did for UML in his classic UML Distilled *Presents realistic use cases and clear explanations of frequently misunderstood concepts, so developers and architects can make the most of NoSQL *Shows how NoSQL can be integrated with existing infrastructure and used to enable the cloud transition. NoSQL technologies are well-suited for many new applications where traditional RDBMSes often don't perform or scale well - including systems requiring large-scale indexing, serving pages on high-traffic websites, and heavy-duty streaming media delivery. In NoSQL Distilled, renowned software expert Martin Fowler and Thoughtworks database consultant Pramod J. Sadalage demystify NoSQL, succinctly explore the architectural and design issues associated with implementing it, and offer realistic use cases. Modeled after UML Distilled Fowler's international best-seller, NoSQL Distilled, covers all this and more: * *Evaluating which enterprise applications NoSQL is (and isn't) appropriate for. *Understanding the architectural tradeoffs associated with deploying NoSQL. *Comparing leading NoSQL offerings such as MongoDB, CouchDB, Cassandra, Riak, and Neo4J. *Integrating NoSQL with legacy systems. *Managing performance, reliability, availability, and recoverability. *Overcoming widespread misconceptions about NoSQL and its tradeoffs. *Understanding how NoSQL can support the transition to cloud-based systems. *Using NoSQL in agile development environments. *Applying NoSQL in search/retrieval, metadata management, text analysis, social networking, business intelligence, and financial services applications. *Understanding NoSQL query languages, including Object Query MDX, and XQuery and more", "image_url": "http://books.google.com.br/books/content?id=tYhsAQAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "isbn": "9780321826626", "number_of_pages": 164, "publication_date": "2012-05-17", "publisher": "Pearson Education"}}]
